app/controllers/news_controller.rb

SELECT COUNT(*) FROM `user_like_news` WHERE `user_like_news`.`user_id` = 3 AND `user_like_news`.`publish_news_id` IS NULL
INSERT INTO `user_like_news` (`created_at`, `publish_news_id`, `updated_at`, `user_id`) VALUES ('2012-08-25 08:04:04', NULL, '2012-08-25 08:04:04', 3)
---
  def like
    news_id = PublishNews.find_by_id(params[:id].to_i)
    #check if user s logged in or a news id is a valid news
    if(!signed_in? || news_id.nil?)
      render :text => false
      return
    end
    if UserLikeNews.where(:user_id => current_user.id, :publish_news_id => news_id.id).empty?
      UserLikeNews.create!(:user_id => current_user.id, :publish_news_id => news_id.id)